org/aliens/asdf-parse-component-form.org
-*- mode: org; fill-column: 95 -*-
@title Подсистема определения. PARSE-COMPONENT-FORM.
@category asdf
@sort asdf004

UPDATED 11.12.2011. Разработчиками были удалены декораторы над ф-ией
REINITIALIZE-INSTANCE. А также упрощён код связанный с повторной
инициализацией или созданием объекта класса/подкласса COMPONENT.

UPDATED 14.12.2011. Скорректирован код обрабатывающий
ключ :weakly-depends-on. Упомянуто отображение в документации того,
что ключ :weakly-depends-on имеет смысл для верхнего уровня
определения системы.

(сказаное ниже относится к версии 2.019.5)

* Overview

Функция PARSE-COMPONENT-FORM вызывается из ф-ии do-defsystem и
представляет собой следующий и главный этап определения системы. Ф-ия
строит иерархию объектов (класса component и его наследников) на
основе передаваемых опций и присоединяет её к другому объекту, её
определение выглядит так:


    (defun* parse-component-form (parent options) ...)


В parent передаётся объект к которому нужно присоединить создаваемую
иерархию, в options передаются ключи управляющие созданием
объектов. Если parse-component-form вызывается из do-defsystem, parent
будет равен nil (это означает, что будет создаваться корневой объект
иерархии). Список options выглядит подобно следующему:

<source>
(:module "exp-system"
  :pathname #P"/home/someuser/lisp/asdf-experiments/"
  :depends-on nil
  :components ((:module "src"
                :pathname ""
                :components ((:file "file1")
                             (:static-file "static.txt")
                             (:file "file2" :depends-on ("file1"))
                             (:file "file3" :depends-on
                             ("file1"))))))
</source>

... это те же опции, что используются в форме (defsystem ...) в
*.asd файлах, но за исключением опции :class (так как, если она
была задана, её обработка произошла до вызова parse-component-form
в ф-ии do-defsystem).

* Логика работы parse-component-form.

** 1. Разбор параметров

   Ф-ия с помощью destructuring-bind разбирает переданные параметры и
   устанавливает локальные переменные соответствующие их ключам. Есть
   правда, небольшое исключение: первые два элемента считаются
   обязательными (а не ключевыми) и локальными переменными для них
   будут type и name. Для примера выше (при разборе options) установки
   этих переменных будут следующие:

   <code>type = :module</code>
   <code>name = "exp-system"</code>

   Остальные имена локальных переменных будут соответствовать
   переданным ключам. Ключи <code>:perform</code>
   <code>:explain</code> <code>:output-files</code>
   <code>:operation-done-p</code> используются для создания
   инлайн-методов (inline methods) специализирующихся на этом
   компоненте, но их обработка происходит вне определения
   parse-component-form (конкретно в ф-ии
   <code>%define-component-inline-methods</code> вызываемой из
   <code>%refresh-component-inline-methods</code>, которая в свою
   очередь вызывается в конце вызова
   <code>parse-component-form</code>) и поэтому они помечены как
   ignorable (игнорируемые) чтобы подавить ненужные
   предупреждения. Вообще список возможных инлайн-методов содержится в
   константе <code>+asdf-methods+</code>. Список содержит символы
   именующие методы, соответственно упомянутым ключам (а также символ
   <code>perform-with-restarts</code>, соответствующий
   недокументированному инлайн-методу). Итак остаются следующие ключи:

* Ключи-параметры

Чтобы вы при чтении дальнейшего описания, примерно представляли о чём
идёт речь (конечно же, для более обстоятельного объяснения стоит
обратится к официальной документации) ниже дано короткое описание,
назначения опций:

** Задающие содержимое, путь, и класс компонента по умолчанию:

<code>:components</code> - компоненты, содержащиеся в данном (например файлы исходников или другие модули).

<code>:pathname</code> - переопределённый путь для компонента.

<code>:default-component-class</code> - класс, которорый будет использоваться при задании типа <code>:file</code>

** Задающие зависимости:

<code>:weakly-depends-on</code> - зависимости загружаются только в случае, если удалось их найти.

<code>:depends-on</code> - зависимости обязательные к загрузке.

** Управляющие порядком операций:

<code>:serial</code> - каждый описанный компонент, становится автоматически зависимым от предыдущего компонента.

<code>:in-order-to</code> - этой опцией можно переопределить порядок применения операций к компонентам.

<code>:do-first</code> - недокументированный ключ, также служит для тонкой настройки, порядка применения операций.

** Дополнительные:

<code>:version</code> - версия компонента (должна быть выше чем может быть указано в зависимостях от этого компонента).

Кроме того, реализация позволяет использовать дополнительные ключи
(для каких-нибудь собственных мета-надстроек), чуть позже список
этих дополнительных ключей будет связан с лексической переменной args.


