public_html/aliens/asdf/asdf-parse-component-form.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Подсистема определения. PARSE-COMPONENT-FORM.</title>
<!-- 2017-10-17 Вт 16:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="rigidus" />
</head>
<body>
<div id="content">
<h1 class="title">Подсистема определения. PARSE-COMPONENT-FORM.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Overview</a></li>
<li><a href="#sec-2">2. Логика работы parse-component-form.</a>
<ul>
<li><a href="#sec-2-1">2.1. 1. Разбор параметров</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Ключи-параметры</a>
<ul>
<li><a href="#sec-3-1">3.1. Задающие содержимое, путь, и класс компонента по умолчанию:</a></li>
<li><a href="#sec-3-2">3.2. Задающие зависимости:</a></li>
<li><a href="#sec-3-3">3.3. Управляющие порядком операций:</a></li>
<li><a href="#sec-3-4">3.4. Дополнительные:</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 2. Проверка того, что опции weakly-depends-on depends-on components in-order-to заданы правильными значениями (списками).</a></li>
<li><a href="#sec-5">5. 3. Проверка на отсутствие или существование компонента только того-же типа на этом же уровне иерархии.</a></li>
<li><a href="#sec-6">6. 4. Проверка на правильное задание ключа :version</a></li>
<li><a href="#sec-7">7. 5. Получение дополнительных ключей.</a></li>
<li><a href="#sec-8">8. 6. Попытка найти старый компонент</a></li>
<li><a href="#sec-9">9. 7. Модифицирование зависимостей depends-on, в соотвии со слабыми зависимостями, задаваемыми ключом weakly-depends-on.</a></li>
<li><a href="#sec-10">10. 8. Добавление зависимости от предыдущего компонента, если необходимо (задана опция :serial t).</a></li>
<li><a href="#sec-11">11. 9. Создание или переинициализация компонента</a>
<ul>
<li><a href="#sec-11-1">11.1. 9.1 Если компонент найден - переинициализация</a></li>
<li><a href="#sec-11-2">11.2. 9.2 Если компонент не найден - создание</a></li>
</ul>
</li>
<li><a href="#sec-12">12. 10. Вычисление слота absolute-pathname</a></li>
<li><a href="#sec-13">13. 11. Получение компонента по умолчанию, создание компонентов, инициализация слота components-by-name</a>
<ul>
<li><a href="#sec-13-1">13.1. 11.1 Вычисление слота default-component-class</a></li>
<li><a href="#sec-13-2">13.2. 11.2 Создание компонентов на основе значения опции :components</a></li>
<li><a href="#sec-13-3">13.3. Инициализация слота components-by-name для быстрого поиска компонентов.</a></li>
</ul>
</li>
<li><a href="#sec-14">14. 12. Установка слота load-dependencies скорректированным значением depends-on</a></li>
<li><a href="#sec-15">15. 13. Cлот in-order-to</a></li>
<li><a href="#sec-16">16. 14. Слот do-first</a></li>
<li><a href="#sec-17">17. 15. Обновление Inline-методов</a>
<ul>
<li><a href="#sec-17-1">17.1. 15.1 Удаление инлайн-методов в ф-ии %remove-component-inline-methods.</a></li>
<li><a href="#sec-17-2">17.2. 15.2 Определение инлайн-методов в ф-ии %define-component-inline-methods.</a></li>
</ul>
</li>
<li><a href="#sec-18">18. 16. Возврат созданного компонента</a></li>
</ul>
</div>
</div>
<p>
UPDATED 11.12.2011. Разработчиками были удалены декораторы над ф-ией
REINITIALIZE-INSTANCE. А также упрощён код связанный с повторной
инициализацией или созданием объекта класса/подкласса COMPONENT.
</p>

<p>
UPDATED 14.12.2011. Скорректирован код обрабатывающий
ключ :weakly-depends-on. Упомянуто отображение в документации того,
что ключ :weakly-depends-on имеет смысл для верхнего уровня
определения системы.
</p>

<p>
(сказаное ниже относится к версии 2.019.5)
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
Функция PARSE-COMPONENT-FORM вызывается из ф-ии do-defsystem и
представляет собой следующий и главный этап определения системы. Ф-ия
строит иерархию объектов (класса component и его наследников) на
основе передаваемых опций и присоединяет её к другому объекту, её
определение выглядит так:
</p>


<p>
(defun* parse-component-form (parent options) &#x2026;)
</p>


<p>
В parent передаётся объект к которому нужно присоединить создаваемую
иерархию, в options передаются ключи управляющие созданием
объектов. Если parse-component-form вызывается из do-defsystem, parent
будет равен nil (это означает, что будет создаваться корневой объект
иерархии). Список options выглядит подобно следующему:
</p>

<p>
&lt;source&gt;
(:module "exp-system"
</p>
<p>
:pathname #P"<i>home/someuser/lisp/asdf-experiments</i>"
</p>
<p>
:depends-on nil
</p>
<p>
:components ((:module "src"
</p>
<p>
:pathname ""
</p>
<p>
                :components ((:file "file1")
                             (:static-file "static.txt")
                             (:file "file2" :depends-on ("file1"))
                             (:file "file3" :depends-on
                             ("file1"))))))
&lt;/source&gt;
</p>

<p>
&#x2026; это те же опции, что используются в форме (defsystem &#x2026;) в
*.asd файлах, но за исключением опции :class (так как, если она
была задана, её обработка произошла до вызова parse-component-form
в ф-ии do-defsystem).
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Логика работы parse-component-form.</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 1. Разбор параметров</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Ф-ия с помощью destructuring-bind разбирает переданные параметры и
устанавливает локальные переменные соответствующие их ключам. Есть
правда, небольшое исключение: первые два элемента считаются
обязательными (а не ключевыми) и локальными переменными для них
будут type и name. Для примера выше (при разборе options) установки
этих переменных будут следующие:
</p>

<p>
&lt;code&gt;type = :module&lt;/code&gt;
&lt;code&gt;name = "exp-system"&lt;/code&gt;
</p>

<p>
Остальные имена локальных переменных будут соответствовать
переданным ключам. Ключи &lt;code&gt;:perform&lt;/code&gt;
&lt;code&gt;:explain&lt;/code&gt; &lt;code&gt;:output-files&lt;/code&gt;
&lt;code&gt;:operation-done-p&lt;/code&gt; используются для создания
инлайн-методов (inline methods) специализирующихся на этом
компоненте, но их обработка происходит вне определения
parse-component-form (конкретно в ф-ии
&lt;code&gt;%define-component-inline-methods&lt;/code&gt; вызываемой из
&lt;code&gt;%refresh-component-inline-methods&lt;/code&gt;, которая в свою
очередь вызывается в конце вызова
&lt;code&gt;parse-component-form&lt;/code&gt;) и поэтому они помечены как
ignorable (игнорируемые) чтобы подавить ненужные
предупреждения. Вообще список возможных инлайн-методов содержится в
константе &lt;code&gt;+asdf-methods+&lt;/code&gt;. Список содержит символы
именующие методы, соответственно упомянутым ключам (а также символ
&lt;code&gt;perform-with-restarts&lt;/code&gt;, соответствующий
недокументированному инлайн-методу). Итак остаются следующие ключи:
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Ключи-параметры</h2>
<div class="outline-text-2" id="text-3">
<p>
Чтобы вы при чтении дальнейшего описания, примерно представляли о чём
идёт речь (конечно же, для более обстоятельного объяснения стоит
обратится к официальной документации) ниже дано короткое описание,
назначения опций:
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Задающие содержимое, путь, и класс компонента по умолчанию:</h3>
<div class="outline-text-3" id="text-3-1">
<p>
&lt;code&gt;:components&lt;/code&gt; - компоненты, содержащиеся в данном (например файлы исходников или другие модули).
</p>

<p>
&lt;code&gt;:pathname&lt;/code&gt; - переопределённый путь для компонента.
</p>

<p>
&lt;code&gt;:default-component-class&lt;/code&gt; - класс, которорый будет использоваться при задании типа &lt;code&gt;:file&lt;/code&gt;
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Задающие зависимости:</h3>
<div class="outline-text-3" id="text-3-2">
<p>
&lt;code&gt;:weakly-depends-on&lt;/code&gt; - зависимости загружаются только в случае, если удалось их найти.
</p>

<p>
&lt;code&gt;:depends-on&lt;/code&gt; - зависимости обязательные к загрузке.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Управляющие порядком операций:</h3>
<div class="outline-text-3" id="text-3-3">
<p>
&lt;code&gt;:serial&lt;/code&gt; - каждый описанный компонент, становится автоматически зависимым от предыдущего компонента.
</p>

<p>
&lt;code&gt;:in-order-to&lt;/code&gt; - этой опцией можно переопределить порядок применения операций к компонентам.
</p>

<p>
&lt;code&gt;:do-first&lt;/code&gt; - недокументированный ключ, также служит для тонкой настройки, порядка применения операций.
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Дополнительные:</h3>
<div class="outline-text-3" id="text-3-4">
<p>
&lt;code&gt;:version&lt;/code&gt; - версия компонента (должна быть выше чем может быть указано в зависимостях от этого компонента).
</p>

<p>
Кроме того, реализация позволяет использовать дополнительные ключи
(для каких-нибудь собственных мета-надстроек), чуть позже список
этих дополнительных ключей будет связан с лексической переменной args.
</p>
</div>
</div>
</div>
