public_html/aliens/asdf/asdf-parse-component-form.html


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 2. Проверка того, что опции weakly-depends-on depends-on components in-order-to заданы правильными значениями (списками).</h2>
<div class="outline-text-2" id="text-4">
<p>
Далее parse-component-form вызывает ф-ию check-component-input для
проверки значений, связанных с лексическими переменными
weakly-depends-on, depends-on, components и in-order-to.
</p>

<p>
&lt;source&gt;
    (check-component-input type name weakly-depends-on depends-on
    components in-order-to)
&lt;/source&gt;
</p>

<p>
&#x2026; значения type и name передаются лишь для формировании
сообщения об ошибке.  Проверка не сложная:
</p>

<ul class="org-ul">
<li>все проверяемые элементы должны быть списком - это раз (пусть
даже и пустым).
</li>

<li>если in-order-to не пустой список, первый его элемент должен быть
тоже списком - это два.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 3. Проверка на отсутствие или существование компонента только того-же типа на этом же уровне иерархии.</h2>
<div class="outline-text-2" id="text-5">
<p>
Дальше идёт проверка того, что если определяемый компонент уже
существует на том же уровне иерархии (а именно в компоненте
parent), то он такого же типа, что и определяемый (иначе
сигнализируется ошибка):
</p>

<p>
&lt;source&gt;
  (when (and parent
             (find-component parent name)
             ;; ignore the same object when rereading the defsystem
             (not
               (typep (find-component parent name)
                       (class-for-type parent type))))
      (error 'duplicate-names :name name))
&lt;/source&gt;
</p>

<p>
В первом вызове parse-component-form аргумент parent равен nil,
поэтому проверка сразу пропускается. А вообще, суть проверки такова:
если parent не nil и компонент найден в parent и тип компонента
отличается от указанно типа, то имеет место коллизия имён и
выбрасывается ошибка duplicate-names.
</p>

<p>
Но почему здесь не сигнализируется ошибка, если был найден
компонент того же типа и с тем же именем что и определяемый? Это
было сделано для ситуации повторного чтения определения системы
(например, если файл .asd изменился). Дело в том, что хэш-таблица в
слоте components-by-name, объекта parent (который должен иметь
тип/подтип module), используемая в методе find-component, будет
содержать (при переопределении системы) старые записи
компонентов. И конечно, найдется компонент с тем же именем, что и
определяемый. Как видно, разработчики сделали так, чтобы
сигнализация ошибки при изменении типа компонентов происходила
пораньше. Непосредственно проверка того, что на том же уровне
иерархии нет компонентов с одинаковым именем, осуществляется в ф-ии
compute-module-components-by-name. Эта ф-ия выполняет итерацию по
содержимому слота components (объекта класса/подкласса module) с
тем, чтобы создать и заполнить хэш-таблицу с записями вида
имя<sub>компонента</sub>-компонент и записать её в слот components-by-name. а
также сигнализировать ошибку duplicate-names, если встретились
компоненты с одинаковым именем. Она будет вызвана здесь же, в
parse-component-form, если определяемый компонент имеет тип/подтип
module.  В показаном выше коде, исопльзуется ф-ия
class-for-type. Её определение достаточно тривиально, но имеет
важный нюанс: используется слот default-component-class
передаваемого объекта parent, а при равенство его NIL -
динамическая переменная <b>default-component-class</b>.
</p>

<p>
&lt;source&gt;
  (defun* class-for-type (parent type) &#x2026;)
&lt;/source&gt;
</p>

<p>
CLASS-FOR-TYPE работает следующим образом:
</p>

<ul class="org-ul">
<li>пытаемся найти класс представленный символом type, сначала в
пакете символа, затем в текущем пакете и наконец в
пакете :asdf :
</li>
</ul>

<p>
&lt;source&gt;
    (loop :for symbol :in (list type
    (find-symbol* type  <b>package</b>)
    (find-symbol* type :asdf))
</p>
<p>
:for class = (and symbol (find-class symbol nil))
</p>
<p>
:when (and class (subtypep class 'component))
</p>
<p>
    :return class)
&lt;/source&gt;
</p>

<ul class="org-ul">
<li>для типа :file делается исключение, для него не обязательно
иметь класс. При его использовании инстанцируемый класс
выбирается следующим образом - если в слоте компонента
default-component-class есть значение, то это будет
возвращаемым значением, если нет, то значением будет класс
<b>default-component-class</b>, который по умолчанию равен
CL-SOURCE-FILE:
</li>
</ul>

<p>
&lt;source&gt;
     (and (eq type :file)
     (or (module-default-component-class parent)
     (find-class <b>default-component-class</b>)))
&lt;/source&gt;
</p>

<p>
Логика работы find-component здесь рассматриваться не будет, так как
это тема для отдельной статьи.
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 4. Проверка на правильное задание ключа :version</h2>
<div class="outline-text-2" id="text-6">
<p>
Если была задана опция с ключом :version, то осуществляется
проверка синтаксической корректности заданной версии. Это должна
быть строка, содержащая числа, разделённые точками:
</p>

<p>
&lt;source&gt;
   (when versionp
      (unless (parse-version version nil)
        (warn &#x2026; )))
&lt;/source&gt;
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 5. Получение дополнительных ключей.</h2>
<div class="outline-text-2" id="text-7">
<p>
Дополнительные ключи связываются с лексической переменной args:
</p>

<p>
&lt;source&gt;
   (let* ((args (list* :name (coerce-name name)
</p>
<p>
:pathname pathname
</p>
<p>
                       :parent parent
                       (remove-keys
                         (remove-keys '(components pathname &#x2026; )
                            rest)))
               &#x2026;)
      &#x2026;)
&lt;/source&gt;
</p>

<p>
Эти ключи и их значения будут участвовать в создании (или
повторной инициализации) компонента. А именно дополнительные
аргументы передаются в make-instance (если компонент ещё не был
создан) или в reinitialize-instance (если компонент был получен,
после успешного поиска в parent), но об этом позже.
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 6. Попытка найти старый компонент</h2>
<div class="outline-text-2" id="text-8">
<p>
Лексической переменной ret присваивается компонент, если он уже был
создан или конкретней: присваивается компонент с именем name
содержащейся в parent:
</p>

<p>
&lt;source&gt;
   (let* (&#x2026;
          (ret (find-component parent name)))
      &#x2026;)
&lt;/source&gt;
</p>

<p>
Если это первый вызов parse-component-form и соотв. аргумент
parent равен nil, а аргумент name соответствует имени определяемой
системы (оно сейчас содержится в переменной name и было передано
через ключевой параметр :module) - вызов вернёт объект
представляющий эту систему. Если же parent и name заданы (не равны
nil), то производится поиск компонента в parent. Это нужно для
того, чтобы заново не пересоздавать уже готовые объекты (а значит
не выделять заново для них память, что важно).
</p>
</div>
</div>
