org/aliens/asdf-parse-component-form.org
* 7. Модифицирование зависимостей depends-on, в соотвии со слабыми зависимостями, задаваемыми ключом weakly-depends-on.

  Теперь обрабатывается ключик :weakly-depends-on - фактически это не
  что иное как список "не обязательных" систем:

<source>
   (when weakly-depends-on
      (appendf depends-on (remove-if (complement #'(lambda (x)
      (find-system x nil))) weakly-depends-on)))
</source>

  В этом коде происходит присоединение к depends-on тех систем которые
  получилось найти. Принцип такой: не нашли, значит обойдёмся. С какой
  стати "систем", ведь функция parse-component-form вызывается (как мы
  увидим позже) вообще для всех элементов системы? Очевидно
  ключ :weakly-depends-on имеет право быть только в форме верхнего
  уровня (по отношению к форме (defsystem ...). Если его указать для
  какого-то вложенного компонента, то логично предположить что будут
  подгружаться системы соответствующие именам в этом списке, что врятли
  соответствует ожиданиям разработчика. Видимо авторам следовало бы либо
  изменить поиск систем на поиск компонентов/файлов либо ввести проверку
  на отсутствия ключа :weakly-depends-on в описании вложенных
  компонентов (впрочем, то что этот ключ имеет смысл для верхнего уровня
  определения системы - теперь, начиная с версии 2.019.5, отображено
  в документации).

* 8. Добавление зависимости от предыдущего компонента, если необходимо (задана опция :serial t).

  Далее используется динамическая переменная *serial-depends-on* -
  если её содержимое не равно nil, это содержимое добавляется в
  depends-on:

<source>
   (when *serial-depends-on*
       (push *serial-depends-on* depends-on))
</source>

  По умолчанию *serial-depends-on* = nil, позже мы увидим в какой
  ситуации это будет не так. Вообще эта переменная работает
  совместно с ключом :serial - она содержит предыдущий, определёный
  в parse-component-form, компонент (на том же уровне иерархии) и
  как видно выше модифицирует список depends-on компонента включая
  туда этот компонент.

* 9. Создание или переинициализация компонента

  Далее, создаётся или переинициализируется объект класса/подкласса
  component:

** 9.1 Если компонент найден - переинициализация

   Если компонент был найден (при первом вызове, это понятное
   дело объект класса system или его наследника), то его необходимо
   повторно инициализировать, используя для этого, в том числе,
   дополнительные опции:

<source>
       (if ret ; preserve identity
         (apply 'reinitialize-instance ret args)
         ...)
</source>


** 9.2 Если компонент не найден - создание

   Если компонента в parent не было найдено - создаётся новый
   объект типа, имя которого связано с локальной type. Причём
   создаётся натурально из указанного типа, например если у вас в
   определении системы указан :module создаётся объект класса
   module. Для получения класса по type используется уже
   рассмотренная выше ф-ия class-for-type. То есть, совершенно
   свободно можете определять свои классы в иерархии наследования
   которых есть класс component и использовать в списках, внутри
   списка опции :components (исключение составляет, как показно выше
   в описании ф-ии class-for-type, ключ :file):

<source>
       (if ret
            (...)
          (setf ret (apply 'make-instance (class-for-type parent type) args)))
</source>

* 10. Вычисление слота absolute-pathname

  Для компонента вычисляется значение слота absolute-pathname:
  (component-pathname ret). Принцип такой: по пути к самому старшему
  предку в иерархии, которым должна быть система, собираются именя
  компонентов и присоединяются к абсолютному пути этого корневого
  компонента, то есть системы. Для объекта-системы же, этот слот
  получает значение из слота relative-pathname, который должен быть
  абсолютным и вычисляется ещё в do-defsystem, а связывается со
  слотом во время повторной инициализации.

* 11. Получение компонента по умолчанию, создание компонентов, инициализация слота components-by-name

11. Далее, если компонент класса 'module (или его наследника) то
    выполняются следующие действия:

** 11.1 Вычисление слота default-component-class

   Как видно из кода он либо берётся из ключа :default-component-class
   либо из соответствующего слота своего предка.

<source>
       (setf (module-default-component-class ret)
                (or default-component-class
                      (and (typep parent 'module)
                               (module-default-component-class
                parent))))
</source>


** 11.2 Создание компонентов на основе значения опции :components

   Затем, на основе списков в значении ключа :components
   создаётся список с объектами созданными из этих списков и
   присваивается слоту 'components:

<source>
     (let ((*serial-depends-on* nil))
         (setf (module-components ret)
               (loop
                  :for c-form :in components
                  :for c = (parse-component-form ret c-form)
                  :for name = (component-name c)
                  :collect c
                  :when serial :do (setf *serial-depends-on* name))))
</source>

   Обратите внимание, что создаётся локальный контекст в котором
   *serial-depends-on* приравнивается к nil, а каждый объект
   создаётся с помощью рекурсивного вызова всё той же
   parse-component-form (но уже в качестве parent выступает
   текущий объект). Здесь мы видим принцип работы ключа :serial -
   если он задан, то parse-component-form выполняется в контексте
   в котором *serial-depends-on* приравнена к предыдущему
   созданному компоненту, это влияет на форму (описанную в пункте
   8):

<source>
     (when *serial-depends-on*
       (push *serial-depends-on* depends-on))
</source>

   ... то есть модифицирует значение depends-on, добавляя к нему имя
   предыдущего созданного компонента.

** Инициализация слота components-by-name для быстрого поиска компонентов.

   Заполняется слот components-by-name создаваемой хэш-таблицей для
   быстрого поиска компонентов по имени:

<source>
       (compute-module-components-by-name ret)
</source>

   Там же осуществляется проверка на уникальность имён компонентов.

   Дальнейшие действия происходят не только для объектов
   класса/подкласса module.


* 12. Установка слота load-dependencies скорректированным значением depends-on

12. Далее устанавливается слот load-dependencies:

<source>
   (setf (component-load-dependencies ret) depends-on)
</source>

    ... в значение depends-on которое как мы помним могло быть
    модифицировано формами:

<source>
   (when weakly-depends-on
      (appendf depends-on (remove-if (complement #'find-system)
      weakly-depends-on)))
   (when *serial-depends-on*
      (push *serial-depends-on* depends-on))
</source>

