public_html/aliens/asdf/asdf-parse-component-form.html

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 7. Модифицирование зависимостей depends-on, в соотвии со слабыми зависимостями, задаваемыми ключом weakly-depends-on.</h2>
<div class="outline-text-2" id="text-9">
<p>
Теперь обрабатывается ключик :weakly-depends-on - фактически это не
что иное как список "не обязательных" систем:
</p>

<p>
&lt;source&gt;
   (when weakly-depends-on
      (appendf depends-on (remove-if (complement #'(lambda (x)
      (find-system x nil))) weakly-depends-on)))
&lt;/source&gt;
</p>

<p>
В этом коде происходит присоединение к depends-on тех систем которые
получилось найти. Принцип такой: не нашли, значит обойдёмся. С какой
стати "систем", ведь функция parse-component-form вызывается (как мы
увидим позже) вообще для всех элементов системы? Очевидно
ключ :weakly-depends-on имеет право быть только в форме верхнего
уровня (по отношению к форме (defsystem &#x2026;). Если его указать для
какого-то вложенного компонента, то логично предположить что будут
подгружаться системы соответствующие именам в этом списке, что врятли
соответствует ожиданиям разработчика. Видимо авторам следовало бы либо
изменить поиск систем на поиск компонентов/файлов либо ввести проверку
на отсутствия ключа :weakly-depends-on в описании вложенных
компонентов (впрочем, то что этот ключ имеет смысл для верхнего уровня
определения системы - теперь, начиная с версии 2.019.5, отображено
в документации).
</p>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 8. Добавление зависимости от предыдущего компонента, если необходимо (задана опция :serial t).</h2>
<div class="outline-text-2" id="text-10">
<p>
Далее используется динамическая переменная <b>serial-depends-on</b> -
если её содержимое не равно nil, это содержимое добавляется в
depends-on:
</p>

<p>
&lt;source&gt;
   (when <b>serial-depends-on</b>
       (push <b>serial-depends-on</b> depends-on))
&lt;/source&gt;
</p>

<p>
По умолчанию <b>serial-depends-on</b> = nil, позже мы увидим в какой
ситуации это будет не так. Вообще эта переменная работает
совместно с ключом :serial - она содержит предыдущий, определёный
в parse-component-form, компонент (на том же уровне иерархии) и
как видно выше модифицирует список depends-on компонента включая
туда этот компонент.
</p>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> 9. Создание или переинициализация компонента</h2>
<div class="outline-text-2" id="text-11">
<p>
Далее, создаётся или переинициализируется объект класса/подкласса
component:
</p>
</div>

<div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> 9.1 Если компонент найден - переинициализация</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Если компонент был найден (при первом вызове, это понятное
дело объект класса system или его наследника), то его необходимо
повторно инициализировать, используя для этого, в том числе,
дополнительные опции:
</p>

<p>
&lt;source&gt;
       (if ret ; preserve identity
         (apply 'reinitialize-instance ret args)
         &#x2026;)
&lt;/source&gt;
</p>
</div>
</div>


<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> 9.2 Если компонент не найден - создание</h3>
<div class="outline-text-3" id="text-11-2">
<p>
Если компонента в parent не было найдено - создаётся новый
объект типа, имя которого связано с локальной type. Причём
создаётся натурально из указанного типа, например если у вас в
определении системы указан :module создаётся объект класса
module. Для получения класса по type используется уже
рассмотренная выше ф-ия class-for-type. То есть, совершенно
свободно можете определять свои классы в иерархии наследования
которых есть класс component и использовать в списках, внутри
списка опции :components (исключение составляет, как показно выше
в описании ф-ии class-for-type, ключ :file):
</p>

<p>
&lt;source&gt;
       (if ret
            (&#x2026;)
          (setf ret (apply 'make-instance (class-for-type parent type) args)))
&lt;/source&gt;
</p>
</div>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> 10. Вычисление слота absolute-pathname</h2>
<div class="outline-text-2" id="text-12">
<p>
Для компонента вычисляется значение слота absolute-pathname:
(component-pathname ret). Принцип такой: по пути к самому старшему
предку в иерархии, которым должна быть система, собираются именя
компонентов и присоединяются к абсолютному пути этого корневого
компонента, то есть системы. Для объекта-системы же, этот слот
получает значение из слота relative-pathname, который должен быть
абсолютным и вычисляется ещё в do-defsystem, а связывается со
слотом во время повторной инициализации.
</p>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> 11. Получение компонента по умолчанию, создание компонентов, инициализация слота components-by-name</h2>
<div class="outline-text-2" id="text-13">
<ol class="org-ol">
<li>Далее, если компонент класса 'module (или его наследника) то
выполняются следующие действия:
</li>
</ol>
</div>

<div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> 11.1 Вычисление слота default-component-class</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Как видно из кода он либо берётся из ключа :default-component-class
либо из соответствующего слота своего предка.
</p>

<p>
&lt;source&gt;
       (setf (module-default-component-class ret)
                (or default-component-class
                      (and (typep parent 'module)
                               (module-default-component-class
                parent))))
&lt;/source&gt;
</p>
</div>
</div>


<div id="outline-container-sec-13-2" class="outline-3">
<h3 id="sec-13-2"><span class="section-number-3">13.2</span> 11.2 Создание компонентов на основе значения опции :components</h3>
<div class="outline-text-3" id="text-13-2">
<p>
Затем, на основе списков в значении ключа :components
создаётся список с объектами созданными из этих списков и
присваивается слоту 'components:
</p>

<p>
&lt;source&gt;
     (let ((<b>serial-depends-on</b> nil))
         (setf (module-components ret)
               (loop
</p>
<p>
:for c-form :in components
</p>
<p>
:for c = (parse-component-form ret c-form)
</p>
<p>
:for name = (component-name c)
</p>
<p>
:collect c
</p>
<p>
                  :when serial :do (setf <b>serial-depends-on</b> name))))
&lt;/source&gt;
</p>

<p>
Обратите внимание, что создаётся локальный контекст в котором
<b>serial-depends-on</b> приравнивается к nil, а каждый объект
создаётся с помощью рекурсивного вызова всё той же
parse-component-form (но уже в качестве parent выступает
текущий объект). Здесь мы видим принцип работы ключа :serial -
если он задан, то parse-component-form выполняется в контексте
в котором <b>serial-depends-on</b> приравнена к предыдущему
созданному компоненту, это влияет на форму (описанную в пункте
8):
</p>

<p>
&lt;source&gt;
     (when <b>serial-depends-on</b>
       (push <b>serial-depends-on</b> depends-on))
&lt;/source&gt;
</p>

<p>
&#x2026; то есть модифицирует значение depends-on, добавляя к нему имя
предыдущего созданного компонента.
</p>
</div>
</div>

<div id="outline-container-sec-13-3" class="outline-3">
<h3 id="sec-13-3"><span class="section-number-3">13.3</span> Инициализация слота components-by-name для быстрого поиска компонентов.</h3>
<div class="outline-text-3" id="text-13-3">
<p>
Заполняется слот components-by-name создаваемой хэш-таблицей для
быстрого поиска компонентов по имени:
</p>

<p>
&lt;source&gt;
       (compute-module-components-by-name ret)
&lt;/source&gt;
</p>

<p>
Там же осуществляется проверка на уникальность имён компонентов.
</p>

<p>
Дальнейшие действия происходят не только для объектов
класса/подкласса module.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> 12. Установка слота load-dependencies скорректированным значением depends-on</h2>
<div class="outline-text-2" id="text-14">
<ol class="org-ol">
<li>Далее устанавливается слот load-dependencies:
</li>
</ol>

<p>
&lt;source&gt;
   (setf (component-load-dependencies ret) depends-on)
&lt;/source&gt;
</p>

<p>
&#x2026; в значение depends-on которое как мы помним могло быть
модифицировано формами:
</p>

<p>
&lt;source&gt;
   (when weakly-depends-on
      (appendf depends-on (remove-if (complement #'find-system)
      weakly-depends-on)))
   (when <b>serial-depends-on</b>
      (push <b>serial-depends-on</b> depends-on))
&lt;/source&gt;
</p>
</div>
</div>
