org/aliens/asdf-parse-component-form.org
* 13. Cлот in-order-to

<source>
(setf (component-in-order-to ret)
              (union-of-dependencies
                in-order-to
               `((compile-op (compile-op ,@depends-on))
                  (load-op (load-op ,@depends-on)))))
</source>

  Тело функции union-of-dependencies выглядит довольно
  хитро. Подробности её внутреннего устройство тема для отдельной
  статьи. Для начала следует иметь в виду, что она просто возвратит
  свой второй аргумент если опция :in-order-to не была установлена,
  а значит в этом случае слот in-order-to получит значение:

<source>
    `((compile-op (compile-op ,@depends-on))
       (load-op (load-op ,@depends-on)))
</source>

* 14. Слот do-first

14. Работа со слотом do-first происходит аналогичным образом:

<source>
    (setf (component-do-first ret)
             (union-of-dependencies
                do-first
                `((compile-op (load-op ,@depends-on)))))
</source>

 ... т.е. если опция :do-first не использовалась, то в слоте
 do-first сохраняется более ясное для понимания:

<source>
    `((compile-op (load-op ,@depends-on)))
</source>

* 15. Обновление Inline-методов

  Далее происходит следующее: обновляются, так называемые inline
  методы для компонента:

<source>
    (%refresh-component-inline-methods ret rest)
</source>

  При выполнении этой формы удаляются инлайн-методы компонента и
  определяются заново:

** 15.1 Удаление инлайн-методов в ф-ии %remove-component-inline-methods.

   Сначала удаляются все методы сохранённые в слоте inline-methods из
   обобщённых функций, сохранённых в константе +asdf-methods+:

<source>
   (%remove-component-inline-methods component)
</source>

   Код этой функции достаточно тривиален и я не буду его здесь
   приводить.

** 15.2 Определение инлайн-методов в ф-ии %define-component-inline-methods.

   15.2 Затем слот inline-methods получает новый список методов
   используя для этого список оставшихся опций:

<source>
        (%define-component-inline-methods component rest)
</source>

   Код этой ф-ии тоже не сложный - для каждого символа в
   +asdf-methods+ создаётся соответствующий keyword:

<source>
        (dolist (name +asdf-methods+)
          (let ((keyword (intern (symbol-name name) :keyword)))
           ...))
</source>

   Потом на каждой итерации происходит проход по списку опций
   компонента

<source>
         (loop :for data = rest :then (cddr data) ...)
</source>

   ... и для каждого ключа из списка:

<source>
   (:PERFORM-WITH-RESTARTS :PERFORM :EXPLAIN :OUTPUT-FILES :OPERATION-DONE-P)
</source>

   ...генерируется и выполняется код создающий метод на основе
   значения ассоциированного с ключом:

<source>
       (eval `(defmethod ,name ,qual ((,o ,op) (,c (eql ,ret)))
                     ,@body))
</source>

   Это было неожидано, кстати. И потом, как можно догадаться, он
   кладётся в список слота inline-methods.

* 16. Возврат созданного компонента

  Возвращение созданного компонента в качестве результата.

Для более ясной картины опишу вкратце все 16 действий, выполняемые
parse-component-form:

1. Разбор ключевых параметров с помощью destructuring-bind.

2. Проверка того, что опции weakly-depends-on depends-on components
   in-order-to заданы правильными значениями (списками).

3. Проверка на отсутствие или существование компонента только того-же
   типа на этом же уровне иерархии.

4. Проверка на правильное задание ключа :version.

5. Получение дополнительных ключей.

6. Попытка найти старый компонент.

7. Модифицирование зависимостей depends-on, в соотвии со слабыми
   зависимостями, задаваемыми ключом weakly-depends-on.

8. Добавление зависимости от предыдущего компонента, если необходимо
   (задана опция :serial t).

9. Создание или переинициализация компонента:

   9.1 Если компонент найден при первом вызове, то -
   переинициализация.

   9.2 Если не был найден, то - создание.

10. Вычисление слота absolute-pathname.

11. Получение компонента по умолчанию, создание компонентов,
    инициализация слота components-by-name:

    11.1 Вычисление слота default-component-class по заданной опции
    или по слоту предка.

    11.2 Создание компонентов на основе значения опции :components.

    11.3 Инициализация слота components-by-name для быстрого поиска
    компонентов.

12. Установка слота load-dependencies скорректированным значением
    depends-on.

13. Установка слота in-order-to.

14. Установка слота do-first.

15. Обновление инлайн-методов.

    15.1 Удаление инлайн-методов в ф-ии
    %remove-component-inline-methods.

    15.2 Определение инлайн-методов в ф-ии
    %define-component-inline-methods.

16. Возврат созданного компонента.
