public_html/aliens/asdf/asdf-parse-component-form.html

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> 13. Cлот in-order-to</h2>
<div class="outline-text-2" id="text-15">
<p>
&lt;source&gt;
(setf (component-in-order-to ret)
              (union-of-dependencies
                in-order-to
               `((compile-op (compile-op ,@depends-on))
                  (load-op (load-op ,@depends-on)))))
&lt;/source&gt;
</p>

<p>
Тело функции union-of-dependencies выглядит довольно
хитро. Подробности её внутреннего устройство тема для отдельной
статьи. Для начала следует иметь в виду, что она просто возвратит
свой второй аргумент если опция :in-order-to не была установлена,
а значит в этом случае слот in-order-to получит значение:
</p>

<p>
&lt;source&gt;
    `((compile-op (compile-op ,@depends-on))
       (load-op (load-op ,@depends-on)))
&lt;/source&gt;
</p>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> 14. Слот do-first</h2>
<div class="outline-text-2" id="text-16">
<ol class="org-ol">
<li>Работа со слотом do-first происходит аналогичным образом:
</li>
</ol>

<p>
&lt;source&gt;
    (setf (component-do-first ret)
             (union-of-dependencies
                do-first
                `((compile-op (load-op ,@depends-on)))))
&lt;/source&gt;
</p>

<p>
&#x2026; т.е. если опция :do-first не использовалась, то в слоте
do-first сохраняется более ясное для понимания:
</p>

<p>
&lt;source&gt;
    `((compile-op (load-op ,@depends-on)))
&lt;/source&gt;
</p>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> 15. Обновление Inline-методов</h2>
<div class="outline-text-2" id="text-17">
<p>
Далее происходит следующее: обновляются, так называемые inline
методы для компонента:
</p>

<p>
&lt;source&gt;
    (%refresh-component-inline-methods ret rest)
&lt;/source&gt;
</p>

<p>
При выполнении этой формы удаляются инлайн-методы компонента и
определяются заново:
</p>
</div>

<div id="outline-container-sec-17-1" class="outline-3">
<h3 id="sec-17-1"><span class="section-number-3">17.1</span> 15.1 Удаление инлайн-методов в ф-ии %remove-component-inline-methods.</h3>
<div class="outline-text-3" id="text-17-1">
<p>
Сначала удаляются все методы сохранённые в слоте inline-methods из
обобщённых функций, сохранённых в константе <del>asdf-methods</del>:
</p>

<p>
&lt;source&gt;
   (%remove-component-inline-methods component)
&lt;/source&gt;
</p>

<p>
Код этой функции достаточно тривиален и я не буду его здесь
приводить.
</p>
</div>
</div>

<div id="outline-container-sec-17-2" class="outline-3">
<h3 id="sec-17-2"><span class="section-number-3">17.2</span> 15.2 Определение инлайн-методов в ф-ии %define-component-inline-methods.</h3>
<div class="outline-text-3" id="text-17-2">
<p>
15.2 Затем слот inline-methods получает новый список методов
используя для этого список оставшихся опций:
</p>

<p>
&lt;source&gt;
        (%define-component-inline-methods component rest)
&lt;/source&gt;
</p>

<p>
Код этой ф-ии тоже не сложный - для каждого символа в
<del>asdf-methods</del> создаётся соответствующий keyword:
</p>

<p>
&lt;source&gt;
        (dolist (name <del>asdf-methods</del>)
          (let ((keyword (intern (symbol-name name) :keyword)))
           &#x2026;))
&lt;/source&gt;
</p>

<p>
Потом на каждой итерации происходит проход по списку опций
компонента
</p>

<p>
&lt;source&gt;
         (loop :for data = rest :then (cddr data) &#x2026;)
&lt;/source&gt;
</p>

<p>
&#x2026; и для каждого ключа из списка:
</p>

<p>
&lt;source&gt;
   (:PERFORM-WITH-RESTARTS :PERFORM :EXPLAIN :OUTPUT-FILES :OPERATION-DONE-P)
&lt;/source&gt;
</p>

<p>
&#x2026;генерируется и выполняется код создающий метод на основе
значения ассоциированного с ключом:
</p>

<p>
&lt;source&gt;
       (eval `(defmethod ,name ,qual ((,o ,op) (,c (eql ,ret)))
                     ,@body))
&lt;/source&gt;
</p>

<p>
Это было неожидано, кстати. И потом, как можно догадаться, он
кладётся в список слота inline-methods.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> 16. Возврат созданного компонента</h2>
<div class="outline-text-2" id="text-18">
<p>
Возвращение созданного компонента в качестве результата.
</p>

<p>
Для более ясной картины опишу вкратце все 16 действий, выполняемые
parse-component-form:
</p>

<ol class="org-ol">
<li>Разбор ключевых параметров с помощью destructuring-bind.
</li>

<li>Проверка того, что опции weakly-depends-on depends-on components
in-order-to заданы правильными значениями (списками).
</li>

<li>Проверка на отсутствие или существование компонента только того-же
типа на этом же уровне иерархии.
</li>

<li>Проверка на правильное задание ключа :version.
</li>

<li>Получение дополнительных ключей.
</li>

<li>Попытка найти старый компонент.
</li>

<li>Модифицирование зависимостей depends-on, в соотвии со слабыми
зависимостями, задаваемыми ключом weakly-depends-on.
</li>

<li>Добавление зависимости от предыдущего компонента, если необходимо
(задана опция :serial t).
</li>

<li><p>
Создание или переинициализация компонента:
</p>

<p>
9.1 Если компонент найден при первом вызове, то -
переинициализация.
</p>

<p>
9.2 Если не был найден, то - создание.
</p>
</li>

<li>Вычисление слота absolute-pathname.
</li>

<li><p>
Получение компонента по умолчанию, создание компонентов,
инициализация слота components-by-name:
</p>

<p>
11.1 Вычисление слота default-component-class по заданной опции
или по слоту предка.
</p>

<p>
11.2 Создание компонентов на основе значения опции :components.
</p>

<p>
11.3 Инициализация слота components-by-name для быстрого поиска
компонентов.
</p>
</li>

<li>Установка слота load-dependencies скорректированным значением
depends-on.
</li>

<li>Установка слота in-order-to.
</li>

<li>Установка слота do-first.
</li>

<li><p>
Обновление инлайн-методов.
</p>

<p>
15.1 Удаление инлайн-методов в ф-ии
%remove-component-inline-methods.
</p>

<p>
15.2 Определение инлайн-методов в ф-ии
%define-component-inline-methods.
</p>
</li>

<li>Возврат созданного компонента.
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: rigidus</p>
<p class="date">Created: 2017-10-17 Вт 16:39</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode )</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
